import './App.css';
import Shop from './components/Shop/Shop';
// import 'bootstrap/dist/css/bootstrap.min.css';

function App() {
  return (
    <div className='background'>
      <h1 className='App'>Books Shop</h1>
      <h3 className='App'>Choose 4 Book</h3>
    <Shop></Shop>
    <div className='question'>
    <h1>What is the differences between props and state?</h1>
    <p>
    আপনি কি কখনও ভেবে দেখেছেন কিভাবে আমরা ReactJS-এর উপাদানগুলির মধ্যে ডেটা পাস করতে পারি? আমরা প্রপস এবং স্টেট ব্যবহার করে উপাদানগুলির মধ্যে ডেটা পাস করতে পারি। <br /> <br /> সুতরাং, আসুন আমরা জানি কিভাবে আমরা প্রপস এবং স্টেট ব্যবহার করে ডেটা পাস করতে পারি এবং উভয়ের মধ্যে পার্থক্য বুঝতে পারি।

    আমরা ReactJS-এ একটি উদাহরণ প্রকল্পের সাহায্যে প্রপস এবং স্টেট সম্পর্কে শিখব।
    </p>
    <h1>How react works?</h1>
    <p>
    প্রতিক্রিয়া হল একটি জাভাস্ক্রিপ্ট লাইব্রেরি (কোন ফ্রেমওয়ার্ক নয়) যা ঘোষণামূলক কোড ব্যবহার করে অনুমানযোগ্য এবং দক্ষ উপায়ে ব্যবহারকারী ইন্টারফেস (UIs) তৈরি করে। <br /> <br /> আপনি এটি ব্যবহার করতে পারেন একক পৃষ্ঠার অ্যাপ্লিকেশন এবং মোবাইল অ্যাপ তৈরি করতে, অথবা জটিল অ্যাপ তৈরি করতে যদি আপনি এটি অন্য লাইব্রেরির সাথে ব্যবহার করেন
    প্রতিক্রিয়া ঘোষণামূলক কোডে কাজ করে। ঘোষণামূলক কোড বলতে আমরা কী বুঝি তা দেখানোর জন্য, আমরা চাই আপনি একটি অ্যাপ হিসাবে প্রকাশ করা নিম্নলিখিত কোডটি কল্পনা করুন। একটি নেভিবার, একটি শিরোনাম, একটি ফিল্টার এবং একটি তালিকা সহ আপনি নীচের স্ক্রীনের মতো দেখতে যা ছবি তোলেন৷ কারণ কোডের প্রতিটি লাইন অ্যাপের প্রতিটি উপাদান কী তা ঘোষণা করে।
    </p>
    <h1>how usestate works?</h1>
    <p>

    useState হল একটি হুক যা আপনাকে কার্যকরী উপাদানগুলিতে স্টেট ভেরিয়েবল রাখতে দেয়। আপনি এই ফাংশনে প্রারম্ভিক অবস্থা পাস করেন এবং এটি বর্তমান অবস্থার মান (প্রাথমিক অবস্থা নয়) এবং এই মান আপডেট করার জন্য অন্য একটি ফাংশন সহ একটি ভেরিয়েবল প্রদান করে।<br />পূর্বে বলা হয়েছে, useState আপনাকে ফাংশন উপাদানগুলিতে রাজ্য যোগ করতে সক্ষম করে। একটি ফাংশন কম্পোনেন্টের ভিতরে React.useState কল করলে সেই কম্পোনেন্টের সাথে যুক্ত একটি স্টেট তৈরি হয়।<br />

    যেখানে একটি শ্রেণীতে রাষ্ট্র সর্বদা একটি বস্তু, হুক সহ, রাষ্ট্র যে কোনো ধরনের হতে পারে। রাজ্যের প্রতিটি অংশ একটি একক মান ধারণ করে, যা একটি বস্তু, একটি অ্যারে, একটি বুলিয়ান, বা অন্য কোনো প্রকার যা আপনি কল্পনা করতে পারেন।<br />

    সুতরাং আপনি কখন useState হুক ব্যবহার করবেন? এটি স্থানীয় উপাদান রাজ্যের জন্য বিশেষভাবে কার্যকর, তবে বড় প্রকল্পগুলির জন্য অতিরিক্ত রাষ্ট্র পরিচালনার সমাধানের প্রয়োজন হতে পারে।
    </p>  
    </div>
    </div>
  );
}

export default App;
